# Intro to `Pandas`
**Please do not share this material on any platform or by any other means.**

## Overview
`Pandas` is a major tool that has data structure and manipulation tools to efficiently clean and analyze data. 
- Array-based computing
- Used with NumPy, SciPy, statsmodels, scikit-learn,matplotlib... 
- tabular and heterogeneous data 
  - Provides a multidimensional array object, various derived objects (such as masked arrays and matrices),

In [2]:
# importing the pandas library
import pandas as pd

#check your version of the pandas lib
pd.__version__

'1.0.1'

We'll check out the `DataFrames` and `Series`, structures, data subsetting, indexing, summary statistics, and integration with `numpy`!

### Data Structure: Series
- One-dimensional array-like object containing a sequence of values and corresponding data labels, that are called `index`.
- `index` refers to the axis labels
- Fixed-lenght, ordered dict, as it is a mapping of index values to data values
- Basic way to create a series:
``` python 
sr = pd.Series(data, index=index)```
`data` here can be a list, a dictionary, or a scalar value
`index` should have the same length as `data`

In [3]:
d1_series_v2 = pd.Series([8,4,3,-2,-17,32],index=['tue','mon','wed','thu','sun','fri'])
print ('d1_series_v2:',d1_series_v2 )
print ('d1_series_v2.index:',d1_series_v2.index )

d1_series_v2: tue     8
mon     4
wed     3
thu    -2
sun   -17
fri    32
dtype: int64
d1_series_v2.index: Index(['tue', 'mon', 'wed', 'thu', 'sun', 'fri'], dtype='object')

In [4]:
d1_series_v2[d1_series_v2>0] # select the positive values

tue     8
mon     4
wed     3
fri    32
dtype: int64

In [5]:
d1_series_v2 # original series didn't change

tue     8
mon     4
wed     3
thu    -2
sun   -17
fri    32
dtype: int64

In [6]:
'mon' in d1_series_v2 # check out the whether index is in in the series

True

In [7]:
# index not specified
d1_series = pd.Series([8,4,3,-2,0.3])
d1_series

0    8.0
1    4.0
2    3.0
3   -2.0
4    0.3
dtype: float64

In [8]:
d1_series.values

array([ 8. ,  4. ,  3. , -2. ,  0.3])

In [9]:
d1_series.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
# using a dict to create a series
mydict = {'tue':8,'mon':4,'wed':3,'thu':-2,'sun':-17,'fri':32}
d1_series_v3 = pd.Series(mydict)
d1_series_v3

tue     8
mon     4
wed     3
thu    -2
sun   -17
fri    32
dtype: int64

In [11]:
d1_series_v3 == d1_series_v2 # check value comparison

tue    True
mon    True
wed    True
thu    True
sun    True
fri    True
dtype: bool

In [12]:
d1_series_v3 is d1_series_v2 # check memory location

False

In [15]:
# creating series using a dict and index
days = ['tue','mon','wed2','thu','sun','fri']
d1_series_v4 = pd.Series(mydict,index=days)
d1_series_v4

tue      8.0
mon      4.0
wed2     NaN
thu     -2.0
sun    -17.0
fri     32.0
dtype: float64

#### Checking missing data: use `isnull` and `notnull`

In [16]:
pd.isnull(d1_series_v4)

tue     False
mon     False
wed2     True
thu     False
sun     False
fri     False
dtype: bool

In [17]:
pd.notnull(d1_series_v4)

tue      True
mon      True
wed2    False
thu      True
sun      True
fri      True
dtype: bool

In [18]:
# assign names to both series and the index
d1_series_v4.name = 'temps'
d1_series_v4.index.name = 'days'
d1_series_v4

days
tue      8.0
mon      4.0
wed2     NaN
thu     -2.0
sun    -17.0
fri     32.0
Name: temps, dtype: float64

-----

In [19]:
# updating the series' index, in-place by assignment
d1_series_v4.index = ['a','b','c','d','e','f']
d1_series_v4

a     8.0
b     4.0
c     NaN
d    -2.0
e   -17.0
f    32.0
Name: temps, dtype: float64

In [20]:
# arithmetic operations, broadcasted
d1_series_v4*2

a    16.0
b     8.0
c     NaN
d    -4.0
e   -34.0
f    64.0
Name: temps, dtype: float64

#### Slice and dice

In [21]:
print (d1_series_v4)
print (d1_series_v4[:2])

a     8.0
b     4.0
c     NaN
d    -2.0
e   -17.0
f    32.0
Name: temps, dtype: float64
a    8.0
b    4.0
Name: temps, dtype: float64

In [22]:
# capability to specify timezone
series_w_tz = pd.Series(pd.date_range('2019', periods=2, tz='Etc/GMT-6')) # CST == GMT - 6
series_w_tz

0   2019-01-01 00:00:00+06:00
1   2019-01-02 00:00:00+06:00
dtype: datetime64[ns, Etc/GMT-6]

#### for more info on timezones:
```Python
import pytz
list(filter(lambda x: 'GMT' in x, pytz.all_timezones))
```

### DataFrames 
- a rectangular table of data
- ordered collection of columns
- heterogenous data collection
- row and column index == dict of Series all sharing the same index
- indexes are assigned automatically, if not specified.

- `columns` shows the list of column names and `index` of the df
- `head()` and `tail()` shows top and bottom rows of the dataframe, respecctively

- `describe()` method computes summary statistics of integer / double variables. 
- `info()` function gets the complete information about the data set.

- missing values = > if a column is passed not in the dict, generates missing values

In [23]:
# let's create a date range to use as an index
dates = pd.date_range('20190201', periods=6, freq='M')
dates

DatetimeIndex(['2019-02-28', '2019-03-31', '2019-04-30', '2019-05-31',
               '2019-06-30', '2019-07-31'],
              dtype='datetime64[ns]', freq='M')

In [24]:
import numpy as np
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2019-02-28 -2.028355 -1.273436 -2.173720  0.463913
2019-03-31 -0.101216 -2.568619 -2.145044 -0.725954
2019-04-30  1.586385  0.540329 -1.940115  0.990577
2019-05-31 -0.184937 -1.660854 -0.595185 -1.516348
2019-06-30 -3.010292  0.147537  0.338798 -0.134686
2019-07-31  0.701015 -0.774699 -1.065258 -1.364696

In [25]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [27]:
s2 = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
     'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
print (type(s2))
print (s2)
df = pd.DataFrame(s2)
print (df)

<class 'dict'>
{'one': a    1.0
b    2.0
c    3.0
dtype: float64, 'two': a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64}
   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [26]:
print ('df.index:',df.index)
print ('df.columns:',df.columns)

df.index: DatetimeIndex(['2019-02-28', '2019-03-31', '2019-04-30', '2019-05-31',
               '2019-06-30', '2019-07-31'],
              dtype='datetime64[ns]', freq='M')
df.columns: Index(['A', 'B', 'C', 'D'], dtype='object')

In [27]:
# we can use dictionary of lists
d = {'one': [1., 2., 3., 4.],
     'two': [4., 3., 2., 1.]}
pd.DataFrame(d)
# no index specified

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [28]:
# specify an index, observe the change
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [29]:
population_by_country = pd.DataFrame(
    {'Country': ['Hungary','Peru','Australia','Timor-Leste','Niger',
'Burundi','Luxembourg','Haiti','Netherlands','Lithuania','Mexico','Kazakhstan','Comoros','Italy',
'China','Portugal','Netherlands','Portugal'], 
     'Pop':[9655361,32933835,25088636,1352360,23176691,11575964,
596992,11242856,17132908,2864459,132328035,18592970,850910,59216525,1420062022,10254666,17132908,0],
     'Median_Age': [39,28,38,29,33,23,18,27,40,29,48,20,25,25,33,17,32,999]
    }
)

population_by_country

        Country         Pop  Median_Age
0       Hungary     9655361          39
1          Peru    32933835          28
2     Australia    25088636          38
3   Timor-Leste     1352360          29
4         Niger    23176691          33
5       Burundi    11575964          23
6    Luxembourg      596992          18
7         Haiti    11242856          27
8   Netherlands    17132908          40
9     Lithuania     2864459          29
10       Mexico   132328035          48
11   Kazakhstan    18592970          20
12      Comoros      850910          25
13        Italy    59216525          25
14        China  1420062022          33
15     Portugal    10254666          17
16  Netherlands    17132908          32
17     Portugal           0         999

In [30]:
population_by_country.head()

       Country       Pop  Median_Age
0      Hungary   9655361          39
1         Peru  32933835          28
2    Australia  25088636          38
3  Timor-Leste   1352360          29
4        Niger  23176691          33

In [33]:
population_by_country.tail()

        Country         Pop  Median_Age
13        Italy    59216525          25
14        China  1420062022          33
15     Portugal    10254666          17
16  Netherlands    17132908          32
17     Portugal           0         999

In [31]:
population_by_country.describe()

                Pop  Median_Age
count  1.800000e+01    18.00000
mean   9.966989e+07    83.50000
std    3.309908e+08   228.62228
min    0.000000e+00    17.00000
25%    4.562184e+06    25.00000
50%    1.435444e+07    29.00000
75%    2.461065e+07    36.75000
max    1.420062e+09   999.00000

In [32]:
population_by_country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     18 non-null     object
 1   Pop         18 non-null     int64
 2   Median_Age  18 non-null     int64
dtypes: int64(2), object(1)
memory usage: 560.0+ bytes

### Retrieve columns, rows, and combos
We can retrieve the columns by attribute or using dict-notation, rows by position or name using `loc` attribute!
columns can be deleted like the `dict` using `pop` or `del` command:
```python
del df['one']
onedf = df.pop('one')
```

In [36]:
# retrieve a column by dict-like notation
population_by_country['Pop']

0        9655361
1       32933835
2       25088636
3        1352360
4       23176691
5       11575964
6         596992
7       11242856
8       17132908
9        2864459
10     132328035
11      18592970
12        850910
13      59216525
14    1420062022
15      10254666
16      17132908
17             0
Name: Pop, dtype: int64

In [37]:
# retrieve a column by attribute. Caution, this only works if attribute name is a valid Python variable name
population_by_country.Pop

0        9655361
1       32933835
2       25088636
3        1352360
4       23176691
5       11575964
6         596992
7       11242856
8       17132908
9        2864459
10     132328035
11      18592970
12        850910
13      59216525
14    1420062022
15      10254666
16      17132908
17             0
Name: Pop, dtype: int64

In [38]:
population_by_country.loc[1] # the country listed with 1 in the data frame

Country           Peru
Pop           32933835
Median_Age          28
Name: 1, dtype: object

In [40]:
population_by_country.iloc[1]

Country           Peru
Pop           32933835
Median_Age          28
Name: 1, dtype: object

In [41]:
# sort the dataframe by a column
# inplace = True will make changes to the original data
population_by_country.sort_values(by=['Pop'],ascending=False,inplace=True)

In [42]:
population_by_country

        Country         Pop  Median_Age
14        China  1420062022          33
10       Mexico   132328035          48
13        Italy    59216525          25
1          Peru    32933835          28
2     Australia    25088636          38
4         Niger    23176691          33
11   Kazakhstan    18592970          20
16  Netherlands    17132908          32
8   Netherlands    17132908          40
5       Burundi    11575964          23
7         Haiti    11242856          27
15     Portugal    10254666          17
0       Hungary     9655361          39
9     Lithuania     2864459          29
3   Timor-Leste     1352360          29
12      Comoros      850910          25
6    Luxembourg      596992          18
17     Portugal           0         999

In [43]:
# sort based on multiple columns
population_by_country.sort_values(by=['Median_Age','Country'],ascending=[True,False],inplace=False)
# first sort by median age in ascending order, then sort by the country name in descending order

        Country         Pop  Median_Age
15     Portugal    10254666          17
6    Luxembourg      596992          18
11   Kazakhstan    18592970          20
5       Burundi    11575964          23
13        Italy    59216525          25
12      Comoros      850910          25
7         Haiti    11242856          27
1          Peru    32933835          28
3   Timor-Leste     1352360          29
9     Lithuania     2864459          29
16  Netherlands    17132908          32
4         Niger    23176691          33
14        China  1420062022          33
2     Australia    25088636          38
0       Hungary     9655361          39
8   Netherlands    17132908          40
10       Mexico   132328035          48
17     Portugal           0         999

In [44]:
population_by_country.drop_duplicates() # drops the exact same rows

        Country         Pop  Median_Age
14        China  1420062022          33
10       Mexico   132328035          48
13        Italy    59216525          25
1          Peru    32933835          28
2     Australia    25088636          38
4         Niger    23176691          33
11   Kazakhstan    18592970          20
16  Netherlands    17132908          32
8   Netherlands    17132908          40
5       Burundi    11575964          23
7         Haiti    11242856          27
15     Portugal    10254666          17
0       Hungary     9655361          39
9     Lithuania     2864459          29
3   Timor-Leste     1352360          29
12      Comoros      850910          25
6    Luxembourg      596992          18
17     Portugal           0         999

In [45]:
population_by_country_dedup=population_by_country.drop_duplicates(subset='Country')

In [46]:
population_by_country_dedup

        Country         Pop  Median_Age
14        China  1420062022          33
10       Mexico   132328035          48
13        Italy    59216525          25
1          Peru    32933835          28
2     Australia    25088636          38
4         Niger    23176691          33
11   Kazakhstan    18592970          20
16  Netherlands    17132908          32
5       Burundi    11575964          23
7         Haiti    11242856          27
15     Portugal    10254666          17
0       Hungary     9655361          39
9     Lithuania     2864459          29
3   Timor-Leste     1352360          29
12      Comoros      850910          25
6    Luxembourg      596992          18

In [47]:
population_by_country

        Country         Pop  Median_Age
14        China  1420062022          33
10       Mexico   132328035          48
13        Italy    59216525          25
1          Peru    32933835          28
2     Australia    25088636          38
4         Niger    23176691          33
11   Kazakhstan    18592970          20
16  Netherlands    17132908          32
8   Netherlands    17132908          40
5       Burundi    11575964          23
7         Haiti    11242856          27
15     Portugal    10254666          17
0       Hungary     9655361          39
9     Lithuania     2864459          29
3   Timor-Leste     1352360          29
12      Comoros      850910          25
6    Luxembourg      596992          18
17     Portugal           0         999

In [48]:
print (population_by_country_dedup is population_by_country) # location different

False

In [49]:
population_by_country_dedup.head()

      Country         Pop  Median_Age
14      China  1420062022          33
10     Mexico   132328035          48
13      Italy    59216525          25
1        Peru    32933835          28
2   Australia    25088636          38

In [50]:
population_by_country.head()

      Country         Pop  Median_Age
14      China  1420062022          33
10     Mexico   132328035          48
13      Italy    59216525          25
1        Peru    32933835          28
2   Australia    25088636          38

In [51]:
# add a new column
# classify the countries based on their population ranking
age_group = {'A':20,'B':25,'C':35}

def age_class(Series):
    if Series['Median_Age']>35:
        return "D"
    elif Series['Median_Age']>25:
        return "C"
    elif Series['Median_Age']>20:
        return "B"
    elif Series['Median_Age']<=20:
        return "A"
    
#create a new variable
population_by_country_dedup['age_class'] = population_by_country_dedup.apply(age_class, axis='columns')
population_by_country_dedup

C:\Users\aydinsg\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  app.launch_new_instance()

        Country         Pop  Median_Age age_class
14        China  1420062022          33         C
10       Mexico   132328035          48         D
13        Italy    59216525          25         B
1          Peru    32933835          28         C
2     Australia    25088636          38         D
4         Niger    23176691          33         C
11   Kazakhstan    18592970          20         A
16  Netherlands    17132908          32         C
5       Burundi    11575964          23         B
7         Haiti    11242856          27         C
15     Portugal    10254666          17         A
0       Hungary     9655361          39         D
9     Lithuania     2864459          29         C
3   Timor-Leste     1352360          29         C
12      Comoros      850910          25         B
6    Luxembourg      596992          18         A

In [52]:
population_by_country.assign(pop_10perc_inc = population_by_country['Pop']*0.1)

        Country         Pop  Median_Age  pop_10perc_inc
14        China  1420062022          33     142006202.2
10       Mexico   132328035          48      13232803.5
13        Italy    59216525          25       5921652.5
1          Peru    32933835          28       3293383.5
2     Australia    25088636          38       2508863.6
4         Niger    23176691          33       2317669.1
11   Kazakhstan    18592970          20       1859297.0
16  Netherlands    17132908          32       1713290.8
8   Netherlands    17132908          40       1713290.8
5       Burundi    11575964          23       1157596.4
7         Haiti    11242856          27       1124285.6
15     Portugal    10254666          17       1025466.6
0       Hungary     9655361          39        965536.1
9     Lithuania     2864459          29        286445.9
3   Timor-Leste     1352360          29        135236.0
12      Comoros      850910          25         85091.0
6    Luxembourg      596992          18         59699.2
17     Portugal           0         999             0.0

### Data subsetting and indexing

Operation: 	Syntax >> 	Result
- Select column:	df[col] >> 	Series
- Select row by label: 	df.loc[label] >> 	Series
- Select row by integer location: 	df.iloc[loc]>> 	Series
- Slice rows: 	df[5:10]>> 	DataFrame
- Select rows by boolean vector: 	df[bool_vec] >> 	DataFrame

In [53]:
s2 = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
      'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(s2)
print (df)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [54]:
df.loc['b'] # get row b

one    2.0
two    2.0
Name: b, dtype: float64

In [55]:
df.iloc[2] # get the row id = 2

one    3.0
two    3.0
Name: c, dtype: float64

In [56]:
df.insert(1, 'three', df['one'])
df

   one  three  two
a  1.0    1.0  1.0
b  2.0    2.0  2.0
c  3.0    3.0  3.0
d  NaN    NaN  4.0

**Intro Done**